app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-07-06 20:58:10.005206"], ["id", 1]]
---
  def update
    student = Student.find(params[:id])
    student.update(student_params)